cases/test_reacting_icoFoam_200muLmin_shortInlet/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

cp -rf 0.org 0
runApplication blockMesh
runApplication decomposePar
#runParallel icoFoam

#------------------------------------------------------------------------------
