cases/test_reacting_icoFoam_200muLmin_shortInlet/Allrun2
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

#runApplication blockMesh
#runApplication decomposePar
runParallel reacting_icoFoam

#------------------------------------------------------------------------------
